{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}F:\WB\Poverty Map\Fay_Herriot_estimation\Results\Tables\extreme_poverty_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}14 Feb 2021, 09:00:47

{com}. do "C:\Users\Rude\AppData\Local\Temp\8\STD7018_000000.tmp"
{txt}
{com}. global directestimators ipcf_munid ipcf_var_munid pobre_extremo_munid pobre_extremo_var_munid samplesize simple_mean_ipcf ///
> simple_mean_pobre_extremo simple_var_ipcf simple_var_pobre_extremo
{txt}
{com}. global vivvars ownviv auto heladera dormi banio lavsec tvradio calentac nhogviv techo pared piso acue freqagua poceac elecpub  
{txt}
{com}. *global headvars h_age h_fem h_single h_primaria h_secundaria h_educ h_ocupado h_desocup h_selfemp h_entrepreneur h_publicsect
. global headvars h_fem h_primaria
{txt}
{com}. global hhvars miembros shchild shoccadult notsch
{txt}
{com}. global munvars occrate unemprate pobrenbi11 shselfemp shentrepreneur shpublicsect shschatt regadm2 regadm3 regadm4 regadm5 regadm6 regadm7 regadm8 regadm9
{txt}
{com}. 
. 
. 
. ********************************************************************************
. *Upload fh census data and merge to fh encovi data
. 
. use "${c -(}dataout{c )-}/census_hhlevel_munid_fhmodel.dta", clear
{txt}(Written by R.              )

{com}. 
. merge 1:1 munid using "${c -(}dataout{c )-}/survey_hhlevel_fhmodel.dta", keepusing(munid munid_str ${c -(}directestimators{c )-})
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             128
{txt}{col 9}from master{col 30}{res}             125{txt}  (_merge==1)
{col 9}from using{col 30}{res}               3{txt}  (_merge==2)

{col 5}matched{col 30}{res}             207{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop _merge
{txt}
{com}. *Note: Several are not matched (3 from encovi are not in census, 125 from census are not in encovi)
. 
. 
. 
. /*==============================================================================
> Activate this if only for entities that were estimated in ENCOVI 2019/20
> ===============================================================================*/
. 
. *drop entidades not sampled in encovi
. drop if entid=="02" | entid=="25" | entid=="10" //12 municipalities
{txt}(12 observations deleted)

{com}. 
. 
. 
. 
. ********************************************************************************
. *A) Extreme poverty rate
. ********************************************************************************
. 
. *b) Extreme Poverty Rate
. 
. *b.1.) Extreme Poverty Rate
. preserve
{txt}
{com}. 
. sum pobre_extremo_var_munid, d

               {txt}(first) pobre_extremo_var_munid
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}        210
{txt}25%    {res} 1.93e-34              0       {txt}Sum of Wgt. {res}        210

{txt}50%    {res}  .001329                      {txt}Mean          {res}  .004487
                        {txt}Largest       Std. Dev.     {res} .0127642
{txt}75%    {res} .0040504       .0347222
{txt}90%    {res} .0099313       .0439159       {txt}Variance      {res} .0001629
{txt}95%    {res} .0152778       .1149178       {txt}Skewness      {res} 7.426322
{txt}99%    {res} .0439159       .1249896       {txt}Kurtosis      {res} 65.86925
{txt}
{com}. fayherriot pobre_extremo_munid ${c -(}vivvars{c )-} ${c -(}headvars{c )-} ${c -(}hhvars{c )-} ${c -(}munvars{c )-}, variance(pobre_extremo_var_munid) gamma nolog ///
> initialvalue(`=r(p50)')

{res}{txt}Sigma2_u estimation method:{col 33}{res}reml{col 50}{txt}N in sample{col 67}={col 69}{res}       204
{txt}Transformation of depvar:{col 33}{res}none{col 50}{txt}N out of sample{col 67}={col 69}{res}       112
{txt}EBLUP and MSE bias correction:{col 33}{res}none{col 50}{txt}Sigma2_u{col 67}={col 69}{res}    0.0222
{txt}{col 50}Adj R-squared{col 67}={col 69}{res}    0.2815
{txt}{col 50}FH R-squared{col 67}={col 69}{res}    0.3184
{txt}{hline 19} Gamma {hline 20}
{col 3}Min{col 13}5%{col 21}Median{col 33}95%{col 43}Max
{res}0.1509{col 11}0.6041{col 21}0.9439{col 31}1.0000{col 41}1.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}pobr~o_munid{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}ownviv {c |}{col 14}{res}{space 2} 1.053991{col 26}{space 2} .3630506{col 37}{space 1}    2.90{col 46}{space 3}0.004{col 54}{space 4} .3424247{col 67}{space 3} 1.765557
{txt}{space 8}auto {c |}{col 14}{res}{space 2} .0958535{col 26}{space 2} .3500069{col 37}{space 1}    0.27{col 46}{space 3}0.784{col 54}{space 4}-.5901474{col 67}{space 3} .7818545
{txt}{space 4}heladera {c |}{col 14}{res}{space 2}-1.028671{col 26}{space 2} .6435872{col 37}{space 1}   -1.60{col 46}{space 3}0.110{col 54}{space 4}-2.290079{col 67}{space 3} .2327369
{txt}{space 7}dormi {c |}{col 14}{res}{space 2} .3717022{col 26}{space 2} .2165698{col 37}{space 1}    1.72{col 46}{space 3}0.086{col 54}{space 4}-.0527667{col 67}{space 3} .7961711
{txt}{space 7}banio {c |}{col 14}{res}{space 2}-.0051966{col 26}{space 2} .1519943{col 37}{space 1}   -0.03{col 46}{space 3}0.973{col 54}{space 4}-.3031001{col 67}{space 3} .2927068
{txt}{space 6}lavsec {c |}{col 14}{res}{space 2} .3535999{col 26}{space 2} .3949869{col 37}{space 1}    0.90{col 46}{space 3}0.371{col 54}{space 4}-.4205601{col 67}{space 3}  1.12776
{txt}{space 5}tvradio {c |}{col 14}{res}{space 2} -.616445{col 26}{space 2} .9588813{col 37}{space 1}   -0.64{col 46}{space 3}0.520{col 54}{space 4}-2.495818{col 67}{space 3} 1.262928
{txt}{space 4}calentac {c |}{col 14}{res}{space 2} .2462034{col 26}{space 2} .1340363{col 37}{space 1}    1.84{col 46}{space 3}0.066{col 54}{space 4}-.0165029{col 67}{space 3} .5089097
{txt}{space 5}nhogviv {c |}{col 14}{res}{space 2} .0658501{col 26}{space 2} .3632012{col 37}{space 1}    0.18{col 46}{space 3}0.856{col 54}{space 4}-.6460111{col 67}{space 3} .7777113
{txt}{space 7}techo {c |}{col 14}{res}{space 2}-.0232332{col 26}{space 2} .1644241{col 37}{space 1}   -0.14{col 46}{space 3}0.888{col 54}{space 4}-.3454986{col 67}{space 3} .2990322
{txt}{space 7}pared {c |}{col 14}{res}{space 2}-.1075457{col 26}{space 2} .2246456{col 37}{space 1}   -0.48{col 46}{space 3}0.632{col 54}{space 4} -.547843{col 67}{space 3} .3327515
{txt}{space 8}piso {c |}{col 14}{res}{space 2}-.0699452{col 26}{space 2} .2485591{col 37}{space 1}   -0.28{col 46}{space 3}0.778{col 54}{space 4}-.5571121{col 67}{space 3} .4172218
{txt}{space 8}acue {c |}{col 14}{res}{space 2} .1791978{col 26}{space 2} .1777062{col 37}{space 1}    1.01{col 46}{space 3}0.313{col 54}{space 4}-.1690998{col 67}{space 3} .5274955
{txt}{space 4}freqagua {c |}{col 14}{res}{space 2}-.0669087{col 26}{space 2} .0756016{col 37}{space 1}   -0.89{col 46}{space 3}0.376{col 54}{space 4}-.2150851{col 67}{space 3} .0812678
{txt}{space 6}poceac {c |}{col 14}{res}{space 2}-.0757178{col 26}{space 2} .0948046{col 37}{space 1}   -0.80{col 46}{space 3}0.424{col 54}{space 4}-.2615313{col 67}{space 3} .1100958
{txt}{space 5}elecpub {c |}{col 14}{res}{space 2} .1061128{col 26}{space 2} .7307773{col 37}{space 1}    0.15{col 46}{space 3}0.885{col 54}{space 4}-1.326184{col 67}{space 3}  1.53841
{txt}{space 7}h_fem {c |}{col 14}{res}{space 2} .7758092{col 26}{space 2} .3620975{col 37}{space 1}    2.14{col 46}{space 3}0.032{col 54}{space 4} .0661111{col 67}{space 3} 1.485507
{txt}{space 2}h_primaria {c |}{col 14}{res}{space 2} .9901767{col 26}{space 2} .3879868{col 37}{space 1}    2.55{col 46}{space 3}0.011{col 54}{space 4} .2297366{col 67}{space 3} 1.750617
{txt}{space 4}miembros {c |}{col 14}{res}{space 2}-.2267198{col 26}{space 2} .1588689{col 37}{space 1}   -1.43{col 46}{space 3}0.154{col 54}{space 4}-.5380971{col 67}{space 3} .0846575
{txt}{space 5}shchild {c |}{col 14}{res}{space 2} 1.290289{col 26}{space 2} 3.758706{col 37}{space 1}    0.34{col 46}{space 3}0.731{col 54}{space 4}-6.076639{col 67}{space 3} 8.657216
{txt}{space 2}shoccadult {c |}{col 14}{res}{space 2} 4.833504{col 26}{space 2} 1.871374{col 37}{space 1}    2.58{col 46}{space 3}0.010{col 54}{space 4} 1.165677{col 67}{space 3}  8.50133
{txt}{space 6}notsch {c |}{col 14}{res}{space 2} -1.68397{col 26}{space 2} 3.635589{col 37}{space 1}   -0.46{col 46}{space 3}0.643{col 54}{space 4}-8.809593{col 67}{space 3} 5.441654
{txt}{space 5}occrate {c |}{col 14}{res}{space 2}-5.906009{col 26}{space 2} 2.307945{col 37}{space 1}   -2.56{col 46}{space 3}0.010{col 54}{space 4} -10.4295{col 67}{space 3} -1.38252
{txt}{space 3}unemprate {c |}{col 14}{res}{space 2} .0274831{col 26}{space 2} .4990005{col 37}{space 1}    0.06{col 46}{space 3}0.956{col 54}{space 4}  -.95054{col 67}{space 3} 1.005506
{txt}{space 2}pobrenbi11 {c |}{col 14}{res}{space 2} .0154049{col 26}{space 2} .0062083{col 37}{space 1}    2.48{col 46}{space 3}0.013{col 54}{space 4} .0032368{col 67}{space 3}  .027573
{txt}{space 3}shselfemp {c |}{col 14}{res}{space 2}-.0955835{col 26}{space 2} .3148318{col 37}{space 1}   -0.30{col 46}{space 3}0.761{col 54}{space 4}-.7126425{col 67}{space 3} .5214755
{txt}shentrepre~r {c |}{col 14}{res}{space 2}-.5981735{col 26}{space 2} .8495776{col 37}{space 1}   -0.70{col 46}{space 3}0.481{col 54}{space 4}-2.263315{col 67}{space 3} 1.066968
{txt}shpublicsect {c |}{col 14}{res}{space 2}-.0318636{col 26}{space 2} .2573641{col 37}{space 1}   -0.12{col 46}{space 3}0.901{col 54}{space 4}-.5362879{col 67}{space 3} .4725607
{txt}{space 4}shschatt {c |}{col 14}{res}{space 2}-1.140915{col 26}{space 2} 2.203454{col 37}{space 1}   -0.52{col 46}{space 3}0.605{col 54}{space 4}-5.459605{col 67}{space 3} 3.177776
{txt}{space 5}regadm2 {c |}{col 14}{res}{space 2}-.0113508{col 26}{space 2} .0805588{col 37}{space 1}   -0.14{col 46}{space 3}0.888{col 54}{space 4}-.1692431{col 67}{space 3} .1465414
{txt}{space 5}regadm3 {c |}{col 14}{res}{space 2}-.0007793{col 26}{space 2} .0616045{col 37}{space 1}   -0.01{col 46}{space 3}0.990{col 54}{space 4}-.1215218{col 67}{space 3} .1199632
{txt}{space 5}regadm4 {c |}{col 14}{res}{space 2} -.026207{col 26}{space 2} .0506179{col 37}{space 1}   -0.52{col 46}{space 3}0.605{col 54}{space 4}-.1254163{col 67}{space 3} .0730022
{txt}{space 5}regadm5 {c |}{col 14}{res}{space 2}-.2088583{col 26}{space 2} .1126976{col 37}{space 1}   -1.85{col 46}{space 3}0.064{col 54}{space 4}-.4297414{col 67}{space 3} .0120249
{txt}{space 5}regadm6 {c |}{col 14}{res}{space 2} -.111892{col 26}{space 2} .0944318{col 37}{space 1}   -1.18{col 46}{space 3}0.236{col 54}{space 4} -.296975{col 67}{space 3}  .073191
{txt}{space 5}regadm7 {c |}{col 14}{res}{space 2}-.3963279{col 26}{space 2} .0862603{col 37}{space 1}   -4.59{col 46}{space 3}0.000{col 54}{space 4} -.565395{col 67}{space 3}-.2272607
{txt}{space 5}regadm8 {c |}{col 14}{res}{space 2}-.1577292{col 26}{space 2} .0615333{col 37}{space 1}   -2.56{col 46}{space 3}0.010{col 54}{space 4}-.2783323{col 67}{space 3}-.0371261
{txt}{space 5}regadm9 {c |}{col 14}{res}{space 2}-.1210251{col 26}{space 2}  .102031{col 37}{space 1}   -1.19{col 46}{space 3}0.236{col 54}{space 4}-.3210022{col 67}{space 3} .0789519
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.347509{col 26}{space 2} 1.480192{col 37}{space 1}    0.91{col 46}{space 3}0.363{col 54}{space 4}-1.553614{col 67}{space 3} 4.248632
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help swilk:Shapiro-Wilk test for normality}:
{col 2}Residuals e (standardized){col 30}V = {res}  20.041{txt}{col 44}p-value = {res}0.000
{txt}{col 2}Random effects u{col 30}V = {res}   8.487{txt}{col 44}p-value = {res}0.000
{txt}{hline 78}

{com}.  
. 
. predict eblupROR, eblup //obtain the EBLUPs
{txt}Some of the selected observations are not in the estimation sample. To these, out-of-sample formulas are applied.
{res}{txt}
{com}. label var eblupROR "EBLUP estimator"
{txt}
{com}. predict mseROR, mse //level of precision (MSE)
{txt}Some of the selected observations are not in the estimation sample. To these, out-of-sample formulas are applied.
{res}{txt}
{com}. label var mseROR "MSE EBLUP"
{txt}
{com}. predict cvROR_FH, cvfh //CV for the direct estimate
{txt}Some of the selected observations are not in the estimation sample. To these, out-of-sample formulas are applied.
{res}{txt}
{com}. label var cvROR_FH "CV (FH Model)"
{txt}
{com}. predict cvROR_direct, cvdirect //CV for FH estimate
{txt}
{com}. label var cvROR_direct "CV (Direct estimator)"
{txt}
{com}. label var pobre_extremo_munid "Direct estimator"
{txt}
{com}. 
. save "$dataout/fh_pobreextremo.dta", replace
{txt}file F:\WB\Poverty Map\Fay_Herriot_estimation\dataout/fh_pobreextremo.dta saved

{com}. 
. asdoc sum pobre_extremo_munid cvROR_direct eblupROR cvROR_FH mseROR, save($tables\EBLUP_ExtremePovertyRate.doc) ///
> title(FH Model - Extreme Poverty Rate (2019/20)) fhc(\b) fs(11) dec(2) label replace

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
pobr~o_munid {c |}{res}        210    .7797755    .1846755          0          1
{txt}cvROR_direct {c |}{res}        209    6.839279    9.495658          0   70.25448
{txt}{space 4}eblupROR {c |}{res}        316    .7758605    .1734651          0   1.271657
{txt}{space 4}cvROR_FH {c |}{res}        315    12.65592    11.81235          0   63.18882
{txt}{space 6}mseROR {c |}{res}        316    .0140912    .0188384          0   .1962145

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
pobr~o_munid {c |}{res}        210    .7797755    .1846755          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
cvROR_direct {c |}{res}        209    6.839279    9.495658          0   70.25448

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}eblupROR {c |}{res}        316    .7758605    .1734651          0   1.271657

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}cvROR_FH {c |}{res}        315    12.65592    11.81235          0   63.18882

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}mseROR {c |}{res}        316    .0140912    .0188384          0   .1962145
Click to Open File:  {browse "F:\WB\Poverty Map\Fay_Herriot_estimation\Results\Tables\EBLUP_ExtremePovertyRate.doc"}
{txt}
{com}. 
. restore
{txt}
{com}. 
. *b.2.) Extreme Poverty Rate with ampl estimation for variance
. preserve
{txt}
{com}. 
. sum pobre_extremo_var_munid, d

               {txt}(first) pobre_extremo_var_munid
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}        210
{txt}25%    {res} 1.93e-34              0       {txt}Sum of Wgt. {res}        210

{txt}50%    {res}  .001329                      {txt}Mean          {res}  .004487
                        {txt}Largest       Std. Dev.     {res} .0127642
{txt}75%    {res} .0040504       .0347222
{txt}90%    {res} .0099313       .0439159       {txt}Variance      {res} .0001629
{txt}95%    {res} .0152778       .1149178       {txt}Skewness      {res} 7.426322
{txt}99%    {res} .0439159       .1249896       {txt}Kurtosis      {res} 65.86925
{txt}
{com}. fayherriot pobre_extremo_munid ${c -(}vivvars{c )-} ${c -(}headvars{c )-} ${c -(}hhvars{c )-} ${c -(}munvars{c )-}, variance(pobre_extremo_var_munid) gamma nolog ///
> initialvalue(`=r(p50)') sigmamethod(ampl)

{res}{txt}Sigma2_u estimation method:{col 33}{res}ampl{col 50}{txt}N in sample{col 67}={col 69}{res}       204
{txt}Transformation of depvar:{col 33}{res}none{col 50}{txt}N out of sample{col 67}={col 69}{res}       112
{txt}EBLUP and MSE bias correction:{col 33}{res}none{col 50}{txt}Sigma2_u{col 67}={col 69}{res}    0.0180
{txt}{col 50}Adj R-squared{col 67}={col 69}{res}    0.2815
{txt}{col 50}FH R-squared{col 67}={col 69}{res}    0.3184
{txt}{hline 19} Gamma {hline 20}
{col 3}Min{col 13}5%{col 21}Median{col 33}95%{col 43}Max
{res}0.1258{col 11}0.5526{col 21}0.9316{col 31}1.0000{col 41}1.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}pobr~o_munid{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}ownviv {c |}{col 14}{res}{space 2} 1.046286{col 26}{space 2} .3298328{col 37}{space 1}    3.17{col 46}{space 3}0.002{col 54}{space 4} .3998259{col 67}{space 3} 1.692747
{txt}{space 8}auto {c |}{col 14}{res}{space 2} .0995417{col 26}{space 2} .3176859{col 37}{space 1}    0.31{col 46}{space 3}0.754{col 54}{space 4}-.5231111{col 67}{space 3} .7221946
{txt}{space 4}heladera {c |}{col 14}{res}{space 2}-1.024805{col 26}{space 2} .5832887{col 37}{space 1}   -1.76{col 46}{space 3}0.079{col 54}{space 4}-2.168029{col 67}{space 3} .1184203
{txt}{space 7}dormi {c |}{col 14}{res}{space 2} .3779834{col 26}{space 2} .1965715{col 37}{space 1}    1.92{col 46}{space 3}0.054{col 54}{space 4}-.0072897{col 67}{space 3} .7632565
{txt}{space 7}banio {c |}{col 14}{res}{space 2}-.0080907{col 26}{space 2} .1382198{col 37}{space 1}   -0.06{col 46}{space 3}0.953{col 54}{space 4}-.2789965{col 67}{space 3}  .262815
{txt}{space 6}lavsec {c |}{col 14}{res}{space 2} .3688278{col 26}{space 2} .3582638{col 37}{space 1}    1.03{col 46}{space 3}0.303{col 54}{space 4}-.3333563{col 67}{space 3} 1.071012
{txt}{space 5}tvradio {c |}{col 14}{res}{space 2} -.602863{col 26}{space 2} .8696831{col 37}{space 1}   -0.69{col 46}{space 3}0.488{col 54}{space 4}-2.307411{col 67}{space 3} 1.101685
{txt}{space 4}calentac {c |}{col 14}{res}{space 2} .2464491{col 26}{space 2} .1217637{col 37}{space 1}    2.02{col 46}{space 3}0.043{col 54}{space 4} .0077967{col 67}{space 3} .4851015
{txt}{space 5}nhogviv {c |}{col 14}{res}{space 2} .0624613{col 26}{space 2} .3293536{col 37}{space 1}    0.19{col 46}{space 3}0.850{col 54}{space 4}-.5830599{col 67}{space 3} .7079826
{txt}{space 7}techo {c |}{col 14}{res}{space 2}-.0158739{col 26}{space 2} .1493456{col 37}{space 1}   -0.11{col 46}{space 3}0.915{col 54}{space 4}-.3085859{col 67}{space 3}  .276838
{txt}{space 7}pared {c |}{col 14}{res}{space 2} -.111853{col 26}{space 2} .2042052{col 37}{space 1}   -0.55{col 46}{space 3}0.584{col 54}{space 4}-.5120878{col 67}{space 3} .2883818
{txt}{space 8}piso {c |}{col 14}{res}{space 2}-.0774775{col 26}{space 2} .2257725{col 37}{space 1}   -0.34{col 46}{space 3}0.731{col 54}{space 4}-.5199835{col 67}{space 3} .3650286
{txt}{space 8}acue {c |}{col 14}{res}{space 2} .1800091{col 26}{space 2} .1618978{col 37}{space 1}    1.11{col 46}{space 3}0.266{col 54}{space 4}-.1373047{col 67}{space 3} .4973228
{txt}{space 4}freqagua {c |}{col 14}{res}{space 2}-.0685306{col 26}{space 2} .0687901{col 37}{space 1}   -1.00{col 46}{space 3}0.319{col 54}{space 4}-.2033567{col 67}{space 3} .0662955
{txt}{space 6}poceac {c |}{col 14}{res}{space 2}-.0791775{col 26}{space 2} .0860594{col 37}{space 1}   -0.92{col 46}{space 3}0.358{col 54}{space 4}-.2478508{col 67}{space 3} .0894959
{txt}{space 5}elecpub {c |}{col 14}{res}{space 2} .0967761{col 26}{space 2} .6627388{col 37}{space 1}    0.15{col 46}{space 3}0.884{col 54}{space 4}-1.202168{col 67}{space 3}  1.39572
{txt}{space 7}h_fem {c |}{col 14}{res}{space 2} .7550136{col 26}{space 2} .3289686{col 37}{space 1}    2.30{col 46}{space 3}0.022{col 54}{space 4}  .110247{col 67}{space 3}  1.39978
{txt}{space 2}h_primaria {c |}{col 14}{res}{space 2} .9943496{col 26}{space 2} .3522336{col 37}{space 1}    2.82{col 46}{space 3}0.005{col 54}{space 4} .3039845{col 67}{space 3} 1.684715
{txt}{space 4}miembros {c |}{col 14}{res}{space 2}-.2243503{col 26}{space 2} .1439694{col 37}{space 1}   -1.56{col 46}{space 3}0.119{col 54}{space 4}-.5065252{col 67}{space 3} .0578246
{txt}{space 5}shchild {c |}{col 14}{res}{space 2} 1.222955{col 26}{space 2} 3.413428{col 37}{space 1}    0.36{col 46}{space 3}0.720{col 54}{space 4}-5.467242{col 67}{space 3} 7.913152
{txt}{space 2}shoccadult {c |}{col 14}{res}{space 2} 4.947996{col 26}{space 2} 1.704016{col 37}{space 1}    2.90{col 46}{space 3}0.004{col 54}{space 4} 1.608186{col 67}{space 3} 8.287807
{txt}{space 6}notsch {c |}{col 14}{res}{space 2}-1.677515{col 26}{space 2} 3.299331{col 37}{space 1}   -0.51{col 46}{space 3}0.611{col 54}{space 4}-8.144085{col 67}{space 3} 4.789055
{txt}{space 5}occrate {c |}{col 14}{res}{space 2}-6.042454{col 26}{space 2} 2.101032{col 37}{space 1}   -2.88{col 46}{space 3}0.004{col 54}{space 4} -10.1604{col 67}{space 3}-1.924506
{txt}{space 3}unemprate {c |}{col 14}{res}{space 2} .0456126{col 26}{space 2} .4539436{col 37}{space 1}    0.10{col 46}{space 3}0.920{col 54}{space 4}-.8441005{col 67}{space 3} .9353257
{txt}{space 2}pobrenbi11 {c |}{col 14}{res}{space 2}  .015455{col 26}{space 2} .0056203{col 37}{space 1}    2.75{col 46}{space 3}0.006{col 54}{space 4} .0044395{col 67}{space 3} .0264705
{txt}{space 3}shselfemp {c |}{col 14}{res}{space 2}-.0904277{col 26}{space 2} .2859966{col 37}{space 1}   -0.32{col 46}{space 3}0.752{col 54}{space 4}-.6509707{col 67}{space 3} .4701152
{txt}shentrepre~r {c |}{col 14}{res}{space 2} -.617995{col 26}{space 2} .7699517{col 37}{space 1}   -0.80{col 46}{space 3}0.422{col 54}{space 4}-2.127073{col 67}{space 3} .8910825
{txt}shpublicsect {c |}{col 14}{res}{space 2}-.0281842{col 26}{space 2} .2343729{col 37}{space 1}   -0.12{col 46}{space 3}0.904{col 54}{space 4}-.4875466{col 67}{space 3} .4311781
{txt}{space 4}shschatt {c |}{col 14}{res}{space 2}-1.143555{col 26}{space 2} 1.999696{col 37}{space 1}   -0.57{col 46}{space 3}0.567{col 54}{space 4}-5.062887{col 67}{space 3} 2.775776
{txt}{space 5}regadm2 {c |}{col 14}{res}{space 2}-.0111664{col 26}{space 2} .0731335{col 37}{space 1}   -0.15{col 46}{space 3}0.879{col 54}{space 4}-.1545054{col 67}{space 3} .1321725
{txt}{space 5}regadm3 {c |}{col 14}{res}{space 2}-.0002381{col 26}{space 2} .0560195{col 37}{space 1}   -0.00{col 46}{space 3}0.997{col 54}{space 4}-.1100343{col 67}{space 3}  .109558
{txt}{space 5}regadm4 {c |}{col 14}{res}{space 2}-.0258176{col 26}{space 2} .0459113{col 37}{space 1}   -0.56{col 46}{space 3}0.574{col 54}{space 4}-.1158022{col 67}{space 3} .0641669
{txt}{space 5}regadm5 {c |}{col 14}{res}{space 2}-.2112066{col 26}{space 2} .1028989{col 37}{space 1}   -2.05{col 46}{space 3}0.040{col 54}{space 4}-.4128846{col 67}{space 3}-.0095285
{txt}{space 5}regadm6 {c |}{col 14}{res}{space 2} -.111049{col 26}{space 2} .0861469{col 37}{space 1}   -1.29{col 46}{space 3}0.197{col 54}{space 4}-.2798938{col 67}{space 3} .0577957
{txt}{space 5}regadm7 {c |}{col 14}{res}{space 2}-.3988568{col 26}{space 2} .0786256{col 37}{space 1}   -5.07{col 46}{space 3}0.000{col 54}{space 4}-.5529602{col 67}{space 3}-.2447534
{txt}{space 5}regadm8 {c |}{col 14}{res}{space 2}-.1595948{col 26}{space 2} .0557728{col 37}{space 1}   -2.86{col 46}{space 3}0.004{col 54}{space 4}-.2689075{col 67}{space 3}-.0502821
{txt}{space 5}regadm9 {c |}{col 14}{res}{space 2}-.1232275{col 26}{space 2} .0924632{col 37}{space 1}   -1.33{col 46}{space 3}0.183{col 54}{space 4}-.3044519{col 67}{space 3}  .057997
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.341235{col 26}{space 2} 1.344379{col 37}{space 1}    1.00{col 46}{space 3}0.318{col 54}{space 4}-1.293699{col 67}{space 3} 3.976169
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help swilk:Shapiro-Wilk test for normality}:
{col 2}Residuals e (standardized){col 30}V = {res}  17.607{txt}{col 44}p-value = {res}0.000
{txt}{col 2}Random effects u{col 30}V = {res}   8.708{txt}{col 44}p-value = {res}0.000
{txt}{hline 78}

{com}. 
. predict eblupROR, eblup //obtain the EBLUPs
{txt}Some of the selected observations are not in the estimation sample. To these, out-of-sample formulas are applied.
{res}{txt}
{com}. label var eblupROR "EBLUP estimator"
{txt}
{com}. predict mseROR, mse //level of precision (MSE)
{txt}Some of the selected observations are not in the estimation sample. To these, out-of-sample formulas are applied.
{res}{txt}
{com}. label var mseROR "MSE EBLUP"
{txt}
{com}. predict cvROR_FH, cvfh //CV for the direct estimate
{txt}Some of the selected observations are not in the estimation sample. To these, out-of-sample formulas are applied.
{res}{txt}
{com}. label var cvROR_FH "CV (FH Model)"
{txt}
{com}. predict cvROR_direct, cvdirect //CV for FH estimate
{txt}
{com}. label var cvROR_direct "CV (Direct estimator)"
{txt}
{com}. label var pobre_extremo_munid "Direct estimator"
{txt}
{com}. 
. save "$dataout/fh_pobreextremo_ampl.dta", replace
{txt}file F:\WB\Poverty Map\Fay_Herriot_estimation\dataout/fh_pobreextremo_ampl.dta saved

{com}. 
. asdoc sum pobre_extremo_munid cvROR_direct eblupROR cvROR_FH mseROR, save($tables\EBLUP_ExtremePovertyRate.doc) ///
> title(FH Model with ampl estimation - Extreme Poverty Rate (2019/20)) fhc(\b) fs(11) dec(2) label append

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
pobr~o_munid {c |}{res}        210    .7797755    .1846755          0          1
{txt}cvROR_direct {c |}{res}        209    6.839279    9.495658          0   70.25448
{txt}{space 4}eblupROR {c |}{res}        316    .7766131    .1729619          0   1.277347
{txt}{space 4}cvROR_FH {c |}{res}        315     11.7375    10.60837          0   57.60159
{txt}{space 6}mseROR {c |}{res}        316    .0117905    .0153122          0   .1612463

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
pobr~o_munid {c |}{res}        210    .7797755    .1846755          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
cvROR_direct {c |}{res}        209    6.839279    9.495658          0   70.25448

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}eblupROR {c |}{res}        316    .7766131    .1729619          0   1.277347

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}cvROR_FH {c |}{res}        315     11.7375    10.60837          0   57.60159

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}mseROR {c |}{res}        316    .0117905    .0153122          0   .1612463
Click to Open File:  {browse "F:\WB\Poverty Map\Fay_Herriot_estimation\Results\Tables\EBLUP_ExtremePovertyRate.doc"}
{txt}
{com}. 
. restore
{txt}
{com}. 
. 
. *b.3.) Extreme Poverty Rate with aryl estimation for variance
. preserve
{txt}
{com}. 
. sum pobre_extremo_var_munid, d

               {txt}(first) pobre_extremo_var_munid
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}        210
{txt}25%    {res} 1.93e-34              0       {txt}Sum of Wgt. {res}        210

{txt}50%    {res}  .001329                      {txt}Mean          {res}  .004487
                        {txt}Largest       Std. Dev.     {res} .0127642
{txt}75%    {res} .0040504       .0347222
{txt}90%    {res} .0099313       .0439159       {txt}Variance      {res} .0001629
{txt}95%    {res} .0152778       .1149178       {txt}Skewness      {res} 7.426322
{txt}99%    {res} .0439159       .1249896       {txt}Kurtosis      {res} 65.86925
{txt}
{com}. fayherriot pobre_extremo_munid ${c -(}vivvars{c )-} ${c -(}headvars{c )-} ${c -(}hhvars{c )-} ${c -(}munvars{c )-}, variance(pobre_extremo_var_munid) gamma nolog ///
> initialvalue(`=r(p50)') sigmamethod(aryl)

{res}{txt}Sigma2_u estimation method:{col 33}{res}aryl{col 50}{txt}N in sample{col 67}={col 69}{res}       204
{txt}Transformation of depvar:{col 33}{res}none{col 50}{txt}N out of sample{col 67}={col 69}{res}       112
{txt}EBLUP and MSE bias correction:{col 33}{res}none{col 50}{txt}Sigma2_u{col 67}={col 69}{res}    0.0222
{txt}{col 50}Adj R-squared{col 67}={col 69}{res}    0.2815
{txt}{col 50}FH R-squared{col 67}={col 69}{res}    0.3184
{txt}{hline 19} Gamma {hline 20}
{col 3}Min{col 13}5%{col 21}Median{col 33}95%{col 43}Max
{res}0.1509{col 11}0.6041{col 21}0.9439{col 31}1.0000{col 41}1.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}pobr~o_munid{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}ownviv {c |}{col 14}{res}{space 2}  1.05399{col 26}{space 2} .3630488{col 37}{space 1}    2.90{col 46}{space 3}0.004{col 54}{space 4} .3424278{col 67}{space 3} 1.765553
{txt}{space 8}auto {c |}{col 14}{res}{space 2} .0958537{col 26}{space 2} .3500052{col 37}{space 1}    0.27{col 46}{space 3}0.784{col 54}{space 4}-.5901438{col 67}{space 3} .7818512
{txt}{space 4}heladera {c |}{col 14}{res}{space 2}-1.028671{col 26}{space 2} .6435839{col 37}{space 1}   -1.60{col 46}{space 3}0.110{col 54}{space 4}-2.290072{col 67}{space 3} .2327305
{txt}{space 7}dormi {c |}{col 14}{res}{space 2} .3717025{col 26}{space 2} .2165687{col 37}{space 1}    1.72{col 46}{space 3}0.086{col 54}{space 4}-.0527643{col 67}{space 3} .7961693
{txt}{space 7}banio {c |}{col 14}{res}{space 2}-.0051968{col 26}{space 2} .1519936{col 37}{space 1}   -0.03{col 46}{space 3}0.973{col 54}{space 4}-.3030987{col 67}{space 3} .2927052
{txt}{space 6}lavsec {c |}{col 14}{res}{space 2} .3536006{col 26}{space 2} .3949848{col 37}{space 1}    0.90{col 46}{space 3}0.371{col 54}{space 4}-.4205554{col 67}{space 3} 1.127757
{txt}{space 5}tvradio {c |}{col 14}{res}{space 2}-.6164442{col 26}{space 2} .9588764{col 37}{space 1}   -0.64{col 46}{space 3}0.520{col 54}{space 4}-2.495808{col 67}{space 3} 1.262919
{txt}{space 4}calentac {c |}{col 14}{res}{space 2} .2462034{col 26}{space 2} .1340356{col 37}{space 1}    1.84{col 46}{space 3}0.066{col 54}{space 4}-.0165016{col 67}{space 3} .5089084
{txt}{space 5}nhogviv {c |}{col 14}{res}{space 2} .0658499{col 26}{space 2} .3631993{col 37}{space 1}    0.18{col 46}{space 3}0.856{col 54}{space 4}-.6460077{col 67}{space 3} .7777075
{txt}{space 7}techo {c |}{col 14}{res}{space 2}-.0232328{col 26}{space 2} .1644233{col 37}{space 1}   -0.14{col 46}{space 3}0.888{col 54}{space 4}-.3454966{col 67}{space 3}  .299031
{txt}{space 7}pared {c |}{col 14}{res}{space 2}-.1075459{col 26}{space 2} .2246445{col 37}{space 1}   -0.48{col 46}{space 3}0.632{col 54}{space 4} -.547841{col 67}{space 3} .3327491
{txt}{space 8}piso {c |}{col 14}{res}{space 2}-.0699456{col 26}{space 2} .2485579{col 37}{space 1}   -0.28{col 46}{space 3}0.778{col 54}{space 4}-.5571101{col 67}{space 3}  .417219
{txt}{space 8}acue {c |}{col 14}{res}{space 2} .1791979{col 26}{space 2} .1777053{col 37}{space 1}    1.01{col 46}{space 3}0.313{col 54}{space 4}-.1690981{col 67}{space 3} .5274938
{txt}{space 4}freqagua {c |}{col 14}{res}{space 2}-.0669088{col 26}{space 2} .0756012{col 37}{space 1}   -0.89{col 46}{space 3}0.376{col 54}{space 4}-.2150845{col 67}{space 3}  .081267
{txt}{space 6}poceac {c |}{col 14}{res}{space 2} -.075718{col 26}{space 2} .0948041{col 37}{space 1}   -0.80{col 46}{space 3}0.424{col 54}{space 4}-.2615306{col 67}{space 3} .1100947
{txt}{space 5}elecpub {c |}{col 14}{res}{space 2} .1061123{col 26}{space 2} .7307735{col 37}{space 1}    0.15{col 46}{space 3}0.885{col 54}{space 4}-1.326178{col 67}{space 3} 1.538402
{txt}{space 7}h_fem {c |}{col 14}{res}{space 2} .7758081{col 26}{space 2} .3620957{col 37}{space 1}    2.14{col 46}{space 3}0.032{col 54}{space 4} .0661135{col 67}{space 3} 1.485503
{txt}{space 2}h_primaria {c |}{col 14}{res}{space 2}  .990177{col 26}{space 2} .3879848{col 37}{space 1}    2.55{col 46}{space 3}0.011{col 54}{space 4} .2297407{col 67}{space 3} 1.750613
{txt}{space 4}miembros {c |}{col 14}{res}{space 2}-.2267197{col 26}{space 2} .1588681{col 37}{space 1}   -1.43{col 46}{space 3}0.154{col 54}{space 4}-.5380954{col 67}{space 3}  .084656
{txt}{space 5}shchild {c |}{col 14}{res}{space 2} 1.290285{col 26}{space 2} 3.758687{col 37}{space 1}    0.34{col 46}{space 3}0.731{col 54}{space 4}-6.076606{col 67}{space 3} 8.657176
{txt}{space 2}shoccadult {c |}{col 14}{res}{space 2}  4.83351{col 26}{space 2} 1.871365{col 37}{space 1}    2.58{col 46}{space 3}0.010{col 54}{space 4} 1.165701{col 67}{space 3} 8.501318
{txt}{space 6}notsch {c |}{col 14}{res}{space 2}-1.683969{col 26}{space 2} 3.635571{col 37}{space 1}   -0.46{col 46}{space 3}0.643{col 54}{space 4}-8.809557{col 67}{space 3} 5.441619
{txt}{space 5}occrate {c |}{col 14}{res}{space 2}-5.906016{col 26}{space 2} 2.307934{col 37}{space 1}   -2.56{col 46}{space 3}0.010{col 54}{space 4}-10.42948{col 67}{space 3} -1.38255
{txt}{space 3}unemprate {c |}{col 14}{res}{space 2}  .027484{col 26}{space 2} .4989981{col 37}{space 1}    0.06{col 46}{space 3}0.956{col 54}{space 4}-.9505342{col 67}{space 3} 1.005502
{txt}{space 2}pobrenbi11 {c |}{col 14}{res}{space 2} .0154049{col 26}{space 2} .0062083{col 37}{space 1}    2.48{col 46}{space 3}0.013{col 54}{space 4} .0032369{col 67}{space 3} .0275729
{txt}{space 3}shselfemp {c |}{col 14}{res}{space 2}-.0955832{col 26}{space 2} .3148302{col 37}{space 1}   -0.30{col 46}{space 3}0.761{col 54}{space 4}-.7126391{col 67}{space 3} .5214727
{txt}shentrepre~r {c |}{col 14}{res}{space 2}-.5981746{col 26}{space 2} .8495733{col 37}{space 1}   -0.70{col 46}{space 3}0.481{col 54}{space 4}-2.263308{col 67}{space 3} 1.066958
{txt}shpublicsect {c |}{col 14}{res}{space 2}-.0318634{col 26}{space 2} .2573628{col 37}{space 1}   -0.12{col 46}{space 3}0.901{col 54}{space 4}-.5362852{col 67}{space 3} .4725585
{txt}{space 4}shschatt {c |}{col 14}{res}{space 2}-1.140914{col 26}{space 2} 2.203443{col 37}{space 1}   -0.52{col 46}{space 3}0.605{col 54}{space 4}-5.459583{col 67}{space 3} 3.177755
{txt}{space 5}regadm2 {c |}{col 14}{res}{space 2}-.0113508{col 26}{space 2} .0805583{col 37}{space 1}   -0.14{col 46}{space 3}0.888{col 54}{space 4}-.1692423{col 67}{space 3} .1465407
{txt}{space 5}regadm3 {c |}{col 14}{res}{space 2}-.0007793{col 26}{space 2} .0616041{col 37}{space 1}   -0.01{col 46}{space 3}0.990{col 54}{space 4}-.1215212{col 67}{space 3} .1199626
{txt}{space 5}regadm4 {c |}{col 14}{res}{space 2} -.026207{col 26}{space 2} .0506176{col 37}{space 1}   -0.52{col 46}{space 3}0.605{col 54}{space 4}-.1254158{col 67}{space 3} .0730017
{txt}{space 5}regadm5 {c |}{col 14}{res}{space 2}-.2088584{col 26}{space 2}  .112697{col 37}{space 1}   -1.85{col 46}{space 3}0.064{col 54}{space 4}-.4297405{col 67}{space 3} .0120237
{txt}{space 5}regadm6 {c |}{col 14}{res}{space 2} -.111892{col 26}{space 2} .0944314{col 37}{space 1}   -1.18{col 46}{space 3}0.236{col 54}{space 4}-.2969741{col 67}{space 3} .0731901
{txt}{space 5}regadm7 {c |}{col 14}{res}{space 2} -.396328{col 26}{space 2} .0862599{col 37}{space 1}   -4.59{col 46}{space 3}0.000{col 54}{space 4}-.5653943{col 67}{space 3}-.2272617
{txt}{space 5}regadm8 {c |}{col 14}{res}{space 2}-.1577293{col 26}{space 2}  .061533{col 37}{space 1}   -2.56{col 46}{space 3}0.010{col 54}{space 4}-.2783318{col 67}{space 3}-.0371268
{txt}{space 5}regadm9 {c |}{col 14}{res}{space 2}-.1210252{col 26}{space 2} .1020305{col 37}{space 1}   -1.19{col 46}{space 3}0.236{col 54}{space 4}-.3210012{col 67}{space 3} .0789508
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.347509{col 26}{space 2} 1.480185{col 37}{space 1}    0.91{col 46}{space 3}0.363{col 54}{space 4}  -1.5536{col 67}{space 3} 4.248617
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help swilk:Shapiro-Wilk test for normality}:
{col 2}Residuals e (standardized){col 30}V = {res}  20.040{txt}{col 44}p-value = {res}0.000
{txt}{col 2}Random effects u{col 30}V = {res}   8.487{txt}{col 44}p-value = {res}0.000
{txt}{hline 78}

{com}. 
. predict eblupROR, eblup //obtain the EBLUPs
{txt}Some of the selected observations are not in the estimation sample. To these, out-of-sample formulas are applied.
{res}{txt}
{com}. label var eblupROR "EBLUP estimator"
{txt}
{com}. predict mseROR, mse //level of precision (MSE)
{txt}Some of the selected observations are not in the estimation sample. To these, out-of-sample formulas are applied.
{res}{txt}
{com}. label var mseROR "MSE EBLUP"
{txt}
{com}. predict cvROR_FH, cvfh //CV for the direct estimate
{txt}Some of the selected observations are not in the estimation sample. To these, out-of-sample formulas are applied.
{res}{txt}
{com}. label var cvROR_FH "CV (FH Model)"
{txt}
{com}. predict cvROR_direct, cvdirect //CV for FH estimate
{txt}
{com}. label var cvROR_direct "CV (Direct estimator)"
{txt}
{com}. label var pobre_extremo_munid "Direct estimator"
{txt}
{com}. 
. save "$dataout/fh_pobreextremo_aryl.dta", replace
{txt}file F:\WB\Poverty Map\Fay_Herriot_estimation\dataout/fh_pobreextremo_aryl.dta saved

{com}. 
. asdoc sum pobre_extremo_munid cvROR_direct eblupROR cvROR_FH mseROR, save($tables\EBLUP_ExtremePovertyRate.doc) ///
> title(FH Model with aryl estimation - Extreme Poverty Rate (2019/20)) fhc(\b) fs(11) dec(2) label append

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
pobr~o_munid {c |}{res}        210    .7797755    .1846755          0          1
{txt}cvROR_direct {c |}{res}        209    6.839279    9.495658          0   70.25448
{txt}{space 4}eblupROR {c |}{res}        316    .7758606    .1734651          0   1.271657
{txt}{space 4}cvROR_FH {c |}{res}        315    12.65587    11.81228          0   63.18851
{txt}{space 6}mseROR {c |}{res}        316     .014091    .0188382          0   .1962125

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
pobr~o_munid {c |}{res}        210    .7797755    .1846755          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
cvROR_direct {c |}{res}        209    6.839279    9.495658          0   70.25448

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}eblupROR {c |}{res}        316    .7758606    .1734651          0   1.271657

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}cvROR_FH {c |}{res}        315    12.65587    11.81228          0   63.18851

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}mseROR {c |}{res}        316     .014091    .0188382          0   .1962125
Click to Open File:  {browse "F:\WB\Poverty Map\Fay_Herriot_estimation\Results\Tables\EBLUP_ExtremePovertyRate.doc"}
{txt}
{com}. 
. restore
{txt}
{com}. 
. *b.4.) Extreme Poverty Rate with biascorrection (crude)
. preserve
{txt}
{com}. 
. sum pobre_extremo_var_munid, d

               {txt}(first) pobre_extremo_var_munid
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}        210
{txt}25%    {res} 1.93e-34              0       {txt}Sum of Wgt. {res}        210

{txt}50%    {res}  .001329                      {txt}Mean          {res}  .004487
                        {txt}Largest       Std. Dev.     {res} .0127642
{txt}75%    {res} .0040504       .0347222
{txt}90%    {res} .0099313       .0439159       {txt}Variance      {res} .0001629
{txt}95%    {res} .0152778       .1149178       {txt}Skewness      {res} 7.426322
{txt}99%    {res} .0439159       .1249896       {txt}Kurtosis      {res} 65.86925
{txt}
{com}. fayherriot pobre_extremo_munid ${c -(}vivvars{c )-} ${c -(}headvars{c )-} ${c -(}hhvars{c )-} ${c -(}munvars{c )-}, variance(pobre_extremo_var_munid) gamma nolog ///
> initialvalue(`=r(p50)') biascorrection(crude)

{res}{txt}Sigma2_u estimation method:{col 33}{res}reml{col 50}{txt}N in sample{col 67}={col 69}{res}       204
{txt}Transformation of depvar:{col 33}{res}logarithm{col 50}{txt}N out of sample{col 67}={col 69}{res}       112
{txt}EBLUP and MSE bias correction:{col 33}{res}crude{col 50}{txt}Sigma2_u{col 67}={col 69}{res}    0.0222
{txt}{col 50}Adj R-squared{col 67}={col 69}{res}    0.2815
{txt}{col 50}FH R-squared{col 67}={col 69}{res}    0.3184
{txt}{hline 19} Gamma {hline 20}
{col 3}Min{col 13}5%{col 21}Median{col 33}95%{col 43}Max
{res}0.1509{col 11}0.6041{col 21}0.9439{col 31}1.0000{col 41}1.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}pobr~o_munid{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}ownviv {c |}{col 14}{res}{space 2} 1.053991{col 26}{space 2} .3630506{col 37}{space 1}    2.90{col 46}{space 3}0.004{col 54}{space 4} .3424247{col 67}{space 3} 1.765557
{txt}{space 8}auto {c |}{col 14}{res}{space 2} .0958535{col 26}{space 2} .3500069{col 37}{space 1}    0.27{col 46}{space 3}0.784{col 54}{space 4}-.5901474{col 67}{space 3} .7818545
{txt}{space 4}heladera {c |}{col 14}{res}{space 2}-1.028671{col 26}{space 2} .6435872{col 37}{space 1}   -1.60{col 46}{space 3}0.110{col 54}{space 4}-2.290079{col 67}{space 3} .2327369
{txt}{space 7}dormi {c |}{col 14}{res}{space 2} .3717022{col 26}{space 2} .2165698{col 37}{space 1}    1.72{col 46}{space 3}0.086{col 54}{space 4}-.0527667{col 67}{space 3} .7961711
{txt}{space 7}banio {c |}{col 14}{res}{space 2}-.0051966{col 26}{space 2} .1519943{col 37}{space 1}   -0.03{col 46}{space 3}0.973{col 54}{space 4}-.3031001{col 67}{space 3} .2927068
{txt}{space 6}lavsec {c |}{col 14}{res}{space 2} .3535999{col 26}{space 2} .3949869{col 37}{space 1}    0.90{col 46}{space 3}0.371{col 54}{space 4}-.4205601{col 67}{space 3}  1.12776
{txt}{space 5}tvradio {c |}{col 14}{res}{space 2} -.616445{col 26}{space 2} .9588813{col 37}{space 1}   -0.64{col 46}{space 3}0.520{col 54}{space 4}-2.495818{col 67}{space 3} 1.262928
{txt}{space 4}calentac {c |}{col 14}{res}{space 2} .2462034{col 26}{space 2} .1340363{col 37}{space 1}    1.84{col 46}{space 3}0.066{col 54}{space 4}-.0165029{col 67}{space 3} .5089097
{txt}{space 5}nhogviv {c |}{col 14}{res}{space 2} .0658501{col 26}{space 2} .3632012{col 37}{space 1}    0.18{col 46}{space 3}0.856{col 54}{space 4}-.6460111{col 67}{space 3} .7777113
{txt}{space 7}techo {c |}{col 14}{res}{space 2}-.0232332{col 26}{space 2} .1644241{col 37}{space 1}   -0.14{col 46}{space 3}0.888{col 54}{space 4}-.3454986{col 67}{space 3} .2990322
{txt}{space 7}pared {c |}{col 14}{res}{space 2}-.1075457{col 26}{space 2} .2246456{col 37}{space 1}   -0.48{col 46}{space 3}0.632{col 54}{space 4} -.547843{col 67}{space 3} .3327515
{txt}{space 8}piso {c |}{col 14}{res}{space 2}-.0699452{col 26}{space 2} .2485591{col 37}{space 1}   -0.28{col 46}{space 3}0.778{col 54}{space 4}-.5571121{col 67}{space 3} .4172218
{txt}{space 8}acue {c |}{col 14}{res}{space 2} .1791978{col 26}{space 2} .1777062{col 37}{space 1}    1.01{col 46}{space 3}0.313{col 54}{space 4}-.1690998{col 67}{space 3} .5274955
{txt}{space 4}freqagua {c |}{col 14}{res}{space 2}-.0669087{col 26}{space 2} .0756016{col 37}{space 1}   -0.89{col 46}{space 3}0.376{col 54}{space 4}-.2150851{col 67}{space 3} .0812678
{txt}{space 6}poceac {c |}{col 14}{res}{space 2}-.0757178{col 26}{space 2} .0948046{col 37}{space 1}   -0.80{col 46}{space 3}0.424{col 54}{space 4}-.2615313{col 67}{space 3} .1100958
{txt}{space 5}elecpub {c |}{col 14}{res}{space 2} .1061128{col 26}{space 2} .7307773{col 37}{space 1}    0.15{col 46}{space 3}0.885{col 54}{space 4}-1.326184{col 67}{space 3}  1.53841
{txt}{space 7}h_fem {c |}{col 14}{res}{space 2} .7758092{col 26}{space 2} .3620975{col 37}{space 1}    2.14{col 46}{space 3}0.032{col 54}{space 4} .0661111{col 67}{space 3} 1.485507
{txt}{space 2}h_primaria {c |}{col 14}{res}{space 2} .9901767{col 26}{space 2} .3879868{col 37}{space 1}    2.55{col 46}{space 3}0.011{col 54}{space 4} .2297366{col 67}{space 3} 1.750617
{txt}{space 4}miembros {c |}{col 14}{res}{space 2}-.2267198{col 26}{space 2} .1588689{col 37}{space 1}   -1.43{col 46}{space 3}0.154{col 54}{space 4}-.5380971{col 67}{space 3} .0846575
{txt}{space 5}shchild {c |}{col 14}{res}{space 2} 1.290289{col 26}{space 2} 3.758706{col 37}{space 1}    0.34{col 46}{space 3}0.731{col 54}{space 4}-6.076639{col 67}{space 3} 8.657216
{txt}{space 2}shoccadult {c |}{col 14}{res}{space 2} 4.833504{col 26}{space 2} 1.871374{col 37}{space 1}    2.58{col 46}{space 3}0.010{col 54}{space 4} 1.165677{col 67}{space 3}  8.50133
{txt}{space 6}notsch {c |}{col 14}{res}{space 2} -1.68397{col 26}{space 2} 3.635589{col 37}{space 1}   -0.46{col 46}{space 3}0.643{col 54}{space 4}-8.809593{col 67}{space 3} 5.441654
{txt}{space 5}occrate {c |}{col 14}{res}{space 2}-5.906009{col 26}{space 2} 2.307945{col 37}{space 1}   -2.56{col 46}{space 3}0.010{col 54}{space 4} -10.4295{col 67}{space 3} -1.38252
{txt}{space 3}unemprate {c |}{col 14}{res}{space 2} .0274831{col 26}{space 2} .4990005{col 37}{space 1}    0.06{col 46}{space 3}0.956{col 54}{space 4}  -.95054{col 67}{space 3} 1.005506
{txt}{space 2}pobrenbi11 {c |}{col 14}{res}{space 2} .0154049{col 26}{space 2} .0062083{col 37}{space 1}    2.48{col 46}{space 3}0.013{col 54}{space 4} .0032368{col 67}{space 3}  .027573
{txt}{space 3}shselfemp {c |}{col 14}{res}{space 2}-.0955835{col 26}{space 2} .3148318{col 37}{space 1}   -0.30{col 46}{space 3}0.761{col 54}{space 4}-.7126425{col 67}{space 3} .5214755
{txt}shentrepre~r {c |}{col 14}{res}{space 2}-.5981735{col 26}{space 2} .8495776{col 37}{space 1}   -0.70{col 46}{space 3}0.481{col 54}{space 4}-2.263315{col 67}{space 3} 1.066968
{txt}shpublicsect {c |}{col 14}{res}{space 2}-.0318636{col 26}{space 2} .2573641{col 37}{space 1}   -0.12{col 46}{space 3}0.901{col 54}{space 4}-.5362879{col 67}{space 3} .4725607
{txt}{space 4}shschatt {c |}{col 14}{res}{space 2}-1.140915{col 26}{space 2} 2.203454{col 37}{space 1}   -0.52{col 46}{space 3}0.605{col 54}{space 4}-5.459605{col 67}{space 3} 3.177776
{txt}{space 5}regadm2 {c |}{col 14}{res}{space 2}-.0113508{col 26}{space 2} .0805588{col 37}{space 1}   -0.14{col 46}{space 3}0.888{col 54}{space 4}-.1692431{col 67}{space 3} .1465414
{txt}{space 5}regadm3 {c |}{col 14}{res}{space 2}-.0007793{col 26}{space 2} .0616045{col 37}{space 1}   -0.01{col 46}{space 3}0.990{col 54}{space 4}-.1215218{col 67}{space 3} .1199632
{txt}{space 5}regadm4 {c |}{col 14}{res}{space 2} -.026207{col 26}{space 2} .0506179{col 37}{space 1}   -0.52{col 46}{space 3}0.605{col 54}{space 4}-.1254163{col 67}{space 3} .0730022
{txt}{space 5}regadm5 {c |}{col 14}{res}{space 2}-.2088583{col 26}{space 2} .1126976{col 37}{space 1}   -1.85{col 46}{space 3}0.064{col 54}{space 4}-.4297414{col 67}{space 3} .0120249
{txt}{space 5}regadm6 {c |}{col 14}{res}{space 2} -.111892{col 26}{space 2} .0944318{col 37}{space 1}   -1.18{col 46}{space 3}0.236{col 54}{space 4} -.296975{col 67}{space 3}  .073191
{txt}{space 5}regadm7 {c |}{col 14}{res}{space 2}-.3963279{col 26}{space 2} .0862603{col 37}{space 1}   -4.59{col 46}{space 3}0.000{col 54}{space 4} -.565395{col 67}{space 3}-.2272607
{txt}{space 5}regadm8 {c |}{col 14}{res}{space 2}-.1577292{col 26}{space 2} .0615333{col 37}{space 1}   -2.56{col 46}{space 3}0.010{col 54}{space 4}-.2783323{col 67}{space 3}-.0371261
{txt}{space 5}regadm9 {c |}{col 14}{res}{space 2}-.1210251{col 26}{space 2}  .102031{col 37}{space 1}   -1.19{col 46}{space 3}0.236{col 54}{space 4}-.3210022{col 67}{space 3} .0789519
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.347509{col 26}{space 2} 1.480192{col 37}{space 1}    0.91{col 46}{space 3}0.363{col 54}{space 4}-1.553614{col 67}{space 3} 4.248632
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help swilk:Shapiro-Wilk test for normality}:
{col 2}Residuals e (standardized){col 30}V = {res}  20.041{txt}{col 44}p-value = {res}0.000
{txt}{col 2}Random effects u{col 30}V = {res}   8.487{txt}{col 44}p-value = {res}0.000
{txt}{hline 78}

{com}. 
. predict eblupROR, eblup //obtain the EBLUPs
{txt}Some of the selected observations are not in the estimation sample. To these, out-of-sample formulas are applied.
{res}{txt}
{com}. label var eblupROR "EBLUP estimator"
{txt}
{com}. predict mseROR, mse //level of precision (MSE)
{txt}Some of the selected observations are not in the estimation sample. To these, out-of-sample formulas are applied.
{res}{txt}
{com}. label var mseROR "MSE EBLUP"
{txt}
{com}. predict cvROR_FH, cvfh //CV for the direct estimate
{txt}Some of the selected observations are not in the estimation sample. To these, out-of-sample formulas are applied.
{res}{txt}
{com}. label var cvROR_FH "CV (FH Model)"
{txt}
{com}. predict cvROR_direct, cvdirect //CV for FH estimate
{err}pobre_extremo_munid (y_log) and pobre_extremo_var_munid (Var(y_log)) provided on logarithmic scale. Both were back-transformed before calculating the coefficient of variation as follows: y = exp(y_log), and Var(y) = Var(y_log)*y^2
{txt}
{com}. label var cvROR_direct "CV (Direct estimator)"
{txt}
{com}. label var pobre_extremo_munid "Direct estimator"
{txt}
{com}. 
. save "$dataout/fh_pobreextremo_biascorr.dta", replace
{txt}file F:\WB\Poverty Map\Fay_Herriot_estimation\dataout/fh_pobreextremo_biascorr.dta saved

{com}. 
. asdoc sum pobre_extremo_munid cvROR_direct eblupROR cvROR_FH mseROR, save($tables\EBLUP_ExtremePovertyRate.doc) ///
> title(FH Model with bias correction (crude) - Extreme Poverty Rate (2019/20)) fhc(\b) fs(11) dec(2) label append

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
pobr~o_munid {c |}{res}        210    .7797755    .1846755          0          1
{txt}cvROR_direct {c |}{res}        210     4.42931    5.037046          0   35.35387
{txt}{space 4}eblupROR {c |}{res}        316    2.219355    .3637046          1   3.934423
{txt}{space 4}cvROR_FH {c |}{res}        316    5.465174    3.788172          0   15.80371
{txt}{space 6}mseROR {c |}{res}        316    .0700425    .1570804          0   2.496194

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
pobr~o_munid {c |}{res}        210    .7797755    .1846755          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
cvROR_direct {c |}{res}        210     4.42931    5.037046          0   35.35387

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}eblupROR {c |}{res}        316    2.219355    .3637046          1   3.934423

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}cvROR_FH {c |}{res}        316    5.465174    3.788172          0   15.80371

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}mseROR {c |}{res}        316    .0700425    .1570804          0   2.496194
Click to Open File:  {browse "F:\WB\Poverty Map\Fay_Herriot_estimation\Results\Tables\EBLUP_ExtremePovertyRate.doc"}
{txt}
{com}. 
. restore
{txt}
{com}. 
. 
. 
. ********************************************************************************
. *Run acrsin transformed model 
. 
. gen pobre_extremo_asin = asin(sqrt(pobre_extremo_munid))
{txt}(113 missing values generated)

{com}. replace pobre_extremo_var_munid=0.0000001 if pobre_extremo_var_munid==0 //Correct for 0 variance due to comment below
{txt}(39 real changes made)

{com}. gen designeffect = pobre_extremo_var_munid/simple_var_pobre_extremo //Problem: Those with variance 0 will be missing
{txt}(145 missing values generated)

{com}. gen effsample = pobre_extremo_var_munid/designeffect //157 missing
{txt}(145 missing values generated)

{com}. gen sigma2_e_arcsine = 1/(4*effsample) //157 missing
{txt}(145 missing values generated)

{com}. 
. preserve
{txt}
{com}. 
. sum sigma2_e_arcsine, d

                      {txt}sigma2_e_arcsine
{hline 61}
      Percentiles      Smallest
 1%    {res}        1              1
{txt} 5%    {res}     7.35              1
{txt}10%    {res} 9.000001           2.25       {txt}Obs         {res}        178
{txt}25%    {res} 20.87912           2.25       {txt}Sum of Wgt. {res}        178

{txt}50%    {res} 49.97516                      {txt}Mean          {res} 98.41128
                        {txt}Largest       Std. Dev.     {res}  131.017
{txt}75%    {res} 121.1538            576
{txt}90%    {res}      256       634.3623       {txt}Variance      {res} 17165.47
{txt}95%    {res} 342.5787       744.8682       {txt}Skewness      {res} 3.141427
{txt}99%    {res} 744.8682       927.8269       {txt}Kurtosis      {res} 16.00955
{txt}
{com}. fayherriot pobre_extremo_asin ${c -(}vivvars{c )-} ${c -(}headvars{c )-} ${c -(}hhvars{c )-} ${c -(}munvars{c )-} if sigma2_e_arcsine!=., variance(sigma2_e_arcsine) gamma nolog ///
> initialvalue(`=r(p50)')

{res}{red} Estimated sigma2_u is smaller than 0 (sigma2_u = -121.73324). sigma2_u set to 0.
{txt}Sigma2_u estimation method:{col 33}{res}reml{col 50}{txt}N in sample{col 67}={col 69}{res}       172
{txt}Transformation of depvar:{col 33}{res}none{col 50}{txt}N out of sample{col 67}={col 69}{res}         0
{txt}EBLUP and MSE bias correction:{col 33}{res}none{col 50}{txt}Sigma2_u{col 67}={col 69}{res}    0.0000
{txt}{col 50}Adj R-squared{col 67}={col 69}{res}    0.3019
{txt}{col 50}FH R-squared{col 67}={col 69}{res}         .
{txt}{hline 19} Gamma {hline 20}
{col 3}Min{col 13}5%{col 21}Median{col 33}95%{col 43}Max
{res}0.0000{col 11}0.0000{col 21}0.0000{col 31}0.0000{col 41}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}pobre_extr~n{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}ownviv {c |}{col 14}{res}{space 2} .8682316{col 26}{space 2} 16.07691{col 37}{space 1}    0.05{col 46}{space 3}0.957{col 54}{space 4}-30.64193{col 67}{space 3}  32.3784
{txt}{space 8}auto {c |}{col 14}{res}{space 2}-.5134935{col 26}{space 2} 13.72854{col 37}{space 1}   -0.04{col 46}{space 3}0.970{col 54}{space 4}-27.42094{col 67}{space 3} 26.39395
{txt}{space 4}heladera {c |}{col 14}{res}{space 2}-1.776047{col 26}{space 2} 23.43235{col 37}{space 1}   -0.08{col 46}{space 3}0.940{col 54}{space 4}-47.70262{col 67}{space 3} 44.15052
{txt}{space 7}dormi {c |}{col 14}{res}{space 2}-.2659053{col 26}{space 2} 9.533536{col 37}{space 1}   -0.03{col 46}{space 3}0.978{col 54}{space 4}-18.95129{col 67}{space 3} 18.41948
{txt}{space 7}banio {c |}{col 14}{res}{space 2}-.0898745{col 26}{space 2} 5.782361{col 37}{space 1}   -0.02{col 46}{space 3}0.988{col 54}{space 4}-11.42309{col 67}{space 3} 11.24335
{txt}{space 6}lavsec {c |}{col 14}{res}{space 2} .7204334{col 26}{space 2} 17.84675{col 37}{space 1}    0.04{col 46}{space 3}0.968{col 54}{space 4}-34.25856{col 67}{space 3} 35.69942
{txt}{space 5}tvradio {c |}{col 14}{res}{space 2} .3517021{col 26}{space 2} 30.02811{col 37}{space 1}    0.01{col 46}{space 3}0.991{col 54}{space 4}-58.50231{col 67}{space 3} 59.20571
{txt}{space 4}calentac {c |}{col 14}{res}{space 2} .2221844{col 26}{space 2} 5.225236{col 37}{space 1}    0.04{col 46}{space 3}0.966{col 54}{space 4}-10.01909{col 67}{space 3} 10.46346
{txt}{space 5}nhogviv {c |}{col 14}{res}{space 2}-.6335503{col 26}{space 2} 18.13992{col 37}{space 1}   -0.03{col 46}{space 3}0.972{col 54}{space 4}-36.18714{col 67}{space 3} 34.92004
{txt}{space 7}techo {c |}{col 14}{res}{space 2}-.0434436{col 26}{space 2} 5.729162{col 37}{space 1}   -0.01{col 46}{space 3}0.994{col 54}{space 4}-11.27239{col 67}{space 3} 11.18551
{txt}{space 7}pared {c |}{col 14}{res}{space 2} .6254953{col 26}{space 2} 8.482486{col 37}{space 1}    0.07{col 46}{space 3}0.941{col 54}{space 4}-15.99987{col 67}{space 3} 17.25086
{txt}{space 8}piso {c |}{col 14}{res}{space 2} .4621264{col 26}{space 2} 8.641874{col 37}{space 1}    0.05{col 46}{space 3}0.957{col 54}{space 4}-16.47564{col 67}{space 3} 17.39989
{txt}{space 8}acue {c |}{col 14}{res}{space 2} .3223814{col 26}{space 2} 7.340322{col 37}{space 1}    0.04{col 46}{space 3}0.965{col 54}{space 4}-14.06439{col 67}{space 3} 14.70915
{txt}{space 4}freqagua {c |}{col 14}{res}{space 2}-.1757354{col 26}{space 2} 3.400854{col 37}{space 1}   -0.05{col 46}{space 3}0.959{col 54}{space 4}-6.841288{col 67}{space 3} 6.489817
{txt}{space 6}poceac {c |}{col 14}{res}{space 2}-.0338051{col 26}{space 2} 4.419183{col 37}{space 1}   -0.01{col 46}{space 3}0.994{col 54}{space 4}-8.695244{col 67}{space 3} 8.627634
{txt}{space 5}elecpub {c |}{col 14}{res}{space 2} .5418014{col 26}{space 2} 24.06276{col 37}{space 1}    0.02{col 46}{space 3}0.982{col 54}{space 4}-46.62035{col 67}{space 3} 47.70395
{txt}{space 7}h_fem {c |}{col 14}{res}{space 2} 1.126955{col 26}{space 2} 14.20874{col 37}{space 1}    0.08{col 46}{space 3}0.937{col 54}{space 4}-26.72167{col 67}{space 3} 28.97558
{txt}{space 2}h_primaria {c |}{col 14}{res}{space 2}-.0250112{col 26}{space 2} 13.57236{col 37}{space 1}   -0.00{col 46}{space 3}0.999{col 54}{space 4}-26.62635{col 67}{space 3} 26.57632
{txt}{space 4}miembros {c |}{col 14}{res}{space 2}-.2040041{col 26}{space 2} 7.096833{col 37}{space 1}   -0.03{col 46}{space 3}0.977{col 54}{space 4}-14.11354{col 67}{space 3} 13.70553
{txt}{space 5}shchild {c |}{col 14}{res}{space 2} 1.168716{col 26}{space 2} 146.9868{col 37}{space 1}    0.01{col 46}{space 3}0.994{col 54}{space 4}-286.9202{col 67}{space 3} 289.2576
{txt}{space 2}shoccadult {c |}{col 14}{res}{space 2}-1.283388{col 26}{space 2} 72.58305{col 37}{space 1}   -0.02{col 46}{space 3}0.986{col 54}{space 4}-143.5436{col 67}{space 3} 140.9768
{txt}{space 6}notsch {c |}{col 14}{res}{space 2} .1054047{col 26}{space 2} 149.5668{col 37}{space 1}    0.00{col 46}{space 3}0.999{col 54}{space 4}-293.0402{col 67}{space 3}  293.251
{txt}{space 5}occrate {c |}{col 14}{res}{space 2} 1.730782{col 26}{space 2} 89.37714{col 37}{space 1}    0.02{col 46}{space 3}0.985{col 54}{space 4}-173.4452{col 67}{space 3} 176.9068
{txt}{space 3}unemprate {c |}{col 14}{res}{space 2}-.0171586{col 26}{space 2} 16.91914{col 37}{space 1}   -0.00{col 46}{space 3}0.999{col 54}{space 4}-33.17806{col 67}{space 3} 33.14374
{txt}{space 2}pobrenbi11 {c |}{col 14}{res}{space 2} .0180362{col 26}{space 2} .5662678{col 37}{space 1}    0.03{col 46}{space 3}0.975{col 54}{space 4}-1.091828{col 67}{space 3} 1.127901
{txt}{space 3}shselfemp {c |}{col 14}{res}{space 2} .2528913{col 26}{space 2} 11.41582{col 37}{space 1}    0.02{col 46}{space 3}0.982{col 54}{space 4} -22.1217{col 67}{space 3} 22.62749
{txt}shentrepre~r {c |}{col 14}{res}{space 2}-.3438782{col 26}{space 2} 27.22307{col 37}{space 1}   -0.01{col 46}{space 3}0.990{col 54}{space 4}-53.70012{col 67}{space 3} 53.01236
{txt}shpublicsect {c |}{col 14}{res}{space 2} .3508461{col 26}{space 2} 10.91065{col 37}{space 1}    0.03{col 46}{space 3}0.974{col 54}{space 4}-21.03364{col 67}{space 3} 21.73533
{txt}{space 4}shschatt {c |}{col 14}{res}{space 2}-1.687044{col 26}{space 2} 88.44631{col 37}{space 1}   -0.02{col 46}{space 3}0.985{col 54}{space 4}-175.0386{col 67}{space 3} 171.6645
{txt}{space 5}regadm2 {c |}{col 14}{res}{space 2} .0117305{col 26}{space 2} 3.543237{col 37}{space 1}    0.00{col 46}{space 3}0.997{col 54}{space 4}-6.932887{col 67}{space 3} 6.956348
{txt}{space 5}regadm3 {c |}{col 14}{res}{space 2}-.0662294{col 26}{space 2} 2.969545{col 37}{space 1}   -0.02{col 46}{space 3}0.982{col 54}{space 4}-5.886431{col 67}{space 3} 5.753972
{txt}{space 5}regadm4 {c |}{col 14}{res}{space 2} .0829648{col 26}{space 2} 2.488666{col 37}{space 1}    0.03{col 46}{space 3}0.973{col 54}{space 4}-4.794731{col 67}{space 3} 4.960661
{txt}{space 5}regadm5 {c |}{col 14}{res}{space 2} .0677831{col 26}{space 2} 6.793898{col 37}{space 1}    0.01{col 46}{space 3}0.992{col 54}{space 4}-13.24801{col 67}{space 3} 13.38358
{txt}{space 5}regadm6 {c |}{col 14}{res}{space 2}-.2620453{col 26}{space 2} 4.004262{col 37}{space 1}   -0.07{col 46}{space 3}0.948{col 54}{space 4}-8.110255{col 67}{space 3} 7.586164
{txt}{space 5}regadm7 {c |}{col 14}{res}{space 2}-.3090975{col 26}{space 2} 4.365437{col 37}{space 1}   -0.07{col 46}{space 3}0.944{col 54}{space 4}-8.865197{col 67}{space 3} 8.247002
{txt}{space 5}regadm8 {c |}{col 14}{res}{space 2}-.0646335{col 26}{space 2} 2.966876{col 37}{space 1}   -0.02{col 46}{space 3}0.983{col 54}{space 4}-5.879604{col 67}{space 3} 5.750336
{txt}{space 5}regadm9 {c |}{col 14}{res}{space 2}-.1338097{col 26}{space 2}  4.43827{col 37}{space 1}   -0.03{col 46}{space 3}0.976{col 54}{space 4} -8.83266{col 67}{space 3}  8.56504
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.192697{col 26}{space 2} 62.17827{col 37}{space 1}    0.04{col 46}{space 3}0.972{col 54}{space 4}-119.6745{col 67}{space 3} 124.0599
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help swilk:Shapiro-Wilk test for normality}:
{col 2}Residuals e (standardized){col 30}V = {res}   4.872{txt}{col 44}p-value = {res}0.000
{txt}{col 2}Random effects u{col 30}V = {res}       .{txt}{col 44}p-value = {res}   .
{txt}{hline 78}

{com}. 
. predict eblupROR, eblup //obtain the EBLUPs
{txt}Some of the selected observations are not in the estimation sample. To these, out-of-sample formulas are applied.
{res}{txt}
{com}. label var eblupROR "EBLUP estimator"
{txt}
{com}. predict mseROR, mse //level of precision (MSE)
{txt}Some of the selected observations are not in the estimation sample. To these, out-of-sample formulas are applied.
{res}{txt}
{com}. label var mseROR "MSE EBLUP"
{txt}
{com}. predict cvROR_FH, cvfh //CV for the direct estimate
{txt}Some of the selected observations are not in the estimation sample. To these, out-of-sample formulas are applied.
{res}{txt}
{com}. label var cvROR_FH "CV (FH Model)"
{txt}
{com}. predict cvROR_direct, cvdirect //CV for FH estimate
{txt}
{com}. label var cvROR_direct "CV (Direct estimator)"
{txt}
{com}. label var pobre_extremo_munid "Direct estimator"
{txt}
{com}. 
. save "$dataout/fh_pobreextremo_arcsin.dta", replace
{txt}file F:\WB\Poverty Map\Fay_Herriot_estimation\dataout/fh_pobreextremo_arcsin.dta saved

{com}. 
. asdoc sum pobre_extremo_munid cvROR_direct eblupROR cvROR_FH mseROR, save($tables\EBLUP_ExtremePovertyRate.doc) ///
> title(FH Model with acrsin transformation) - Extreme Poverty Rate (2019/20)) fhc(\b) fs(11) dec(2) label append

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
pobr~o_munid {c |}{res}        210    .7797755    .1846755          0          1
{txt}cvROR_direct {c |}{res}        178    794.5888    457.1284   112.6675   2418.009
{txt}{space 4}eblupROR {c |}{res}        316    1.003594    .1614111   .6010073   1.449213
{txt}{space 4}cvROR_FH {c |}{res}        316    333.4674    147.7736   153.4435   1096.431
{txt}{space 6}mseROR {c |}{res}        316    12.80951    15.03188   2.182432   182.2985

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
pobr~o_munid {c |}{res}        210    .7797755    .1846755          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
cvROR_direct {c |}{res}        178    794.5888    457.1284   112.6675   2418.009

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}eblupROR {c |}{res}        316    1.003594    .1614111   .6010073   1.449213

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}cvROR_FH {c |}{res}        316    333.4674    147.7736   153.4435   1096.431

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}mseROR {c |}{res}        316    12.80951    15.03188   2.182432   182.2985
Click to Open File:  {browse "F:\WB\Poverty Map\Fay_Herriot_estimation\Results\Tables\EBLUP_ExtremePovertyRate.doc"}
{txt}
{com}. 
. restore
{txt}
{com}. 
. 
. 
. ********************************************************************************
. *Run Log-Transformed version of FH Model (predict for all out-of-sample municipalities
. 
. 
. *b) Extreme poverty rate
. generate log_pobre_extremo = log(pobre_extremo_munid) //126 missing values generated
{txt}(114 missing values generated)

{com}. generate directlogvariance = pobre_extremo_var_munid/(pobre_extremo_munid*pobre_extremo_munid) //126 missing values generated
{txt}(114 missing values generated)

{com}. 
. preserve
{txt}
{com}. sum directlogvariance, d

                      {txt}directlogvariance
{hline 61}
      Percentiles      Smallest
 1%    {res} 1.88e-35       3.81e-36
{txt} 5%    {res} 1.69e-34       4.64e-36
{txt}10%    {res} 1.20e-33       1.88e-35       {txt}Obs         {res}        209
{txt}25%    {res} 1.00e-07       3.53e-35       {txt}Sum of Wgt. {res}        209

{txt}50%    {res} .0022694                      {txt}Mean          {res} .0136512
                        {txt}Largest       Std. Dev.     {res} .0481957
{txt}75%    {res} .0089702       .1477672
{txt}90%    {res}     .022       .2666667       {txt}Variance      {res} .0023228
{txt}95%    {res} .0331765       .3176685       {txt}Skewness      {res} 7.009487
{txt}99%    {res} .2666667       .4935692       {txt}Kurtosis      {res} 59.70495
{txt}
{com}. fayherriot log_pobre_extremo ${c -(}vivvars{c )-} ${c -(}headvars{c )-} ${c -(}hhvars{c )-} ${c -(}munvars{c )-}, variance(directlogvariance) gamma nolog logarithm ///
> initialvalue(`=r(p50)') biascorrection(crude)

{res}{txt}Sigma2_u estimation method:{col 33}{res}reml{col 50}{txt}N in sample{col 67}={col 69}{res}       203
{txt}Transformation of depvar:{col 33}{res}logarithm{col 50}{txt}N out of sample{col 67}={col 69}{res}       113
{txt}EBLUP and MSE bias correction:{col 33}{res}crude{col 50}{txt}Sigma2_u{col 67}={col 69}{res}    0.0390
{txt}{col 50}Adj R-squared{col 67}={col 69}{res}    0.2274
{txt}{col 50}FH R-squared{col 67}={col 69}{res}    0.2655
{txt}{hline 19} Gamma {hline 20}
{col 3}Min{col 13}5%{col 21}Median{col 33}95%{col 43}Max
{res}0.0732{col 11}0.5633{col 21}0.9456{col 31}1.0000{col 41}1.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}log_pobre_~o{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}ownviv {c |}{col 14}{res}{space 2} 1.367542{col 26}{space 2}    .4854{col 37}{space 1}    2.82{col 46}{space 3}0.005{col 54}{space 4} .4161755{col 67}{space 3} 2.318908
{txt}{space 8}auto {c |}{col 14}{res}{space 2}  .080075{col 26}{space 2} .4668798{col 37}{space 1}    0.17{col 46}{space 3}0.864{col 54}{space 4}-.8349927{col 67}{space 3} .9951426
{txt}{space 4}heladera {c |}{col 14}{res}{space 2}-.9447924{col 26}{space 2} .8725725{col 37}{space 1}   -1.08{col 46}{space 3}0.279{col 54}{space 4}-2.655003{col 67}{space 3} .7654184
{txt}{space 7}dormi {c |}{col 14}{res}{space 2}  .176712{col 26}{space 2} .2974742{col 37}{space 1}    0.59{col 46}{space 3}0.552{col 54}{space 4}-.4063267{col 67}{space 3} .7597507
{txt}{space 7}banio {c |}{col 14}{res}{space 2}-.1019344{col 26}{space 2} .2040217{col 37}{space 1}   -0.50{col 46}{space 3}0.617{col 54}{space 4}-.5018096{col 67}{space 3} .2979407
{txt}{space 6}lavsec {c |}{col 14}{res}{space 2} .5932733{col 26}{space 2} .5393974{col 37}{space 1}    1.10{col 46}{space 3}0.271{col 54}{space 4}-.4639262{col 67}{space 3} 1.650473
{txt}{space 5}tvradio {c |}{col 14}{res}{space 2}-2.044387{col 26}{space 2} 1.293369{col 37}{space 1}   -1.58{col 46}{space 3}0.114{col 54}{space 4}-4.579343{col 67}{space 3}  .490569
{txt}{space 4}calentac {c |}{col 14}{res}{space 2} .2637868{col 26}{space 2} .1812251{col 37}{space 1}    1.46{col 46}{space 3}0.146{col 54}{space 4}-.0914079{col 67}{space 3} .6189816
{txt}{space 5}nhogviv {c |}{col 14}{res}{space 2} .0531236{col 26}{space 2} .4855092{col 37}{space 1}    0.11{col 46}{space 3}0.913{col 54}{space 4}-.8984568{col 67}{space 3} 1.004704
{txt}{space 7}techo {c |}{col 14}{res}{space 2}-.0642102{col 26}{space 2} .2208049{col 37}{space 1}   -0.29{col 46}{space 3}0.771{col 54}{space 4}-.4969799{col 67}{space 3} .3685595
{txt}{space 7}pared {c |}{col 14}{res}{space 2}-.1142076{col 26}{space 2} .3046185{col 37}{space 1}   -0.37{col 46}{space 3}0.708{col 54}{space 4} -.711249{col 67}{space 3} .4828337
{txt}{space 8}piso {c |}{col 14}{res}{space 2} .0459687{col 26}{space 2} .3345027{col 37}{space 1}    0.14{col 46}{space 3}0.891{col 54}{space 4}-.6096445{col 67}{space 3} .7015819
{txt}{space 8}acue {c |}{col 14}{res}{space 2} .1790291{col 26}{space 2} .2411044{col 37}{space 1}    0.74{col 46}{space 3}0.458{col 54}{space 4}-.2935269{col 67}{space 3}  .651585
{txt}{space 4}freqagua {c |}{col 14}{res}{space 2}-.0741831{col 26}{space 2}  .101273{col 37}{space 1}   -0.73{col 46}{space 3}0.464{col 54}{space 4}-.2726746{col 67}{space 3} .1243083
{txt}{space 6}poceac {c |}{col 14}{res}{space 2}-.0719464{col 26}{space 2} .1270888{col 37}{space 1}   -0.57{col 46}{space 3}0.571{col 54}{space 4}-.3210359{col 67}{space 3} .1771431
{txt}{space 5}elecpub {c |}{col 14}{res}{space 2} .4543606{col 26}{space 2} .9791277{col 37}{space 1}    0.46{col 46}{space 3}0.643{col 54}{space 4}-1.464694{col 67}{space 3} 2.373416
{txt}{space 7}h_fem {c |}{col 14}{res}{space 2} 1.293747{col 26}{space 2} .4874282{col 37}{space 1}    2.65{col 46}{space 3}0.008{col 54}{space 4} .3384055{col 67}{space 3} 2.249089
{txt}{space 2}h_primaria {c |}{col 14}{res}{space 2} .9006902{col 26}{space 2} .5288088{col 37}{space 1}    1.70{col 46}{space 3}0.089{col 54}{space 4}-.1357561{col 67}{space 3} 1.937136
{txt}{space 4}miembros {c |}{col 14}{res}{space 2}-.2554912{col 26}{space 2} .2159005{col 37}{space 1}   -1.18{col 46}{space 3}0.237{col 54}{space 4}-.6786484{col 67}{space 3} .1676659
{txt}{space 5}shchild {c |}{col 14}{res}{space 2}-.2132692{col 26}{space 2}  5.14851{col 37}{space 1}   -0.04{col 46}{space 3}0.967{col 54}{space 4}-10.30416{col 67}{space 3} 9.877625
{txt}{space 2}shoccadult {c |}{col 14}{res}{space 2}  5.69173{col 26}{space 2}  2.52789{col 37}{space 1}    2.25{col 46}{space 3}0.024{col 54}{space 4} .7371559{col 67}{space 3}  10.6463
{txt}{space 6}notsch {c |}{col 14}{res}{space 2}-1.295348{col 26}{space 2} 4.962532{col 37}{space 1}   -0.26{col 46}{space 3}0.794{col 54}{space 4}-11.02173{col 67}{space 3} 8.431036
{txt}{space 5}occrate {c |}{col 14}{res}{space 2}-7.177254{col 26}{space 2} 3.114915{col 37}{space 1}   -2.30{col 46}{space 3}0.021{col 54}{space 4}-13.28237{col 67}{space 3}-1.072134
{txt}{space 3}unemprate {c |}{col 14}{res}{space 2}-.2344254{col 26}{space 2}  .668324{col 37}{space 1}   -0.35{col 46}{space 3}0.726{col 54}{space 4}-1.544316{col 67}{space 3} 1.075466
{txt}{space 2}pobrenbi11 {c |}{col 14}{res}{space 2} .0181134{col 26}{space 2} .0083174{col 37}{space 1}    2.18{col 46}{space 3}0.029{col 54}{space 4} .0018117{col 67}{space 3} .0344152
{txt}{space 3}shselfemp {c |}{col 14}{res}{space 2}-.2525867{col 26}{space 2} .4215824{col 37}{space 1}   -0.60{col 46}{space 3}0.549{col 54}{space 4}-1.078873{col 67}{space 3} .5736996
{txt}shentrepre~r {c |}{col 14}{res}{space 2}-.6035426{col 26}{space 2}  1.13453{col 37}{space 1}   -0.53{col 46}{space 3}0.595{col 54}{space 4} -2.82718{col 67}{space 3} 1.620094
{txt}shpublicsect {c |}{col 14}{res}{space 2} -.039438{col 26}{space 2} .3454055{col 37}{space 1}   -0.11{col 46}{space 3}0.909{col 54}{space 4}-.7164204{col 67}{space 3} .6375443
{txt}{space 4}shschatt {c |}{col 14}{res}{space 2}-.8826314{col 26}{space 2} 2.989872{col 37}{space 1}   -0.30{col 46}{space 3}0.768{col 54}{space 4}-6.742674{col 67}{space 3} 4.977411
{txt}{space 5}regadm2 {c |}{col 14}{res}{space 2}-.0327671{col 26}{space 2} .1083359{col 37}{space 1}   -0.30{col 46}{space 3}0.762{col 54}{space 4}-.2451016{col 67}{space 3} .1795673
{txt}{space 5}regadm3 {c |}{col 14}{res}{space 2}-.0081201{col 26}{space 2}  .082376{col 37}{space 1}   -0.10{col 46}{space 3}0.921{col 54}{space 4} -.169574{col 67}{space 3} .1533339
{txt}{space 5}regadm4 {c |}{col 14}{res}{space 2}-.0082928{col 26}{space 2} .0673988{col 37}{space 1}   -0.12{col 46}{space 3}0.902{col 54}{space 4}-.1403921{col 67}{space 3} .1238065
{txt}{space 5}regadm5 {c |}{col 14}{res}{space 2}-.2404855{col 26}{space 2} .1496823{col 37}{space 1}   -1.61{col 46}{space 3}0.108{col 54}{space 4}-.5338573{col 67}{space 3} .0528863
{txt}{space 5}regadm6 {c |}{col 14}{res}{space 2}-.2139775{col 26}{space 2} .1305959{col 37}{space 1}   -1.64{col 46}{space 3}0.101{col 54}{space 4}-.4699408{col 67}{space 3} .0419859
{txt}{space 5}regadm7 {c |}{col 14}{res}{space 2}-.5491465{col 26}{space 2} .1172147{col 37}{space 1}   -4.68{col 46}{space 3}0.000{col 54}{space 4} -.778883{col 67}{space 3}-.3194099
{txt}{space 5}regadm8 {c |}{col 14}{res}{space 2}-.2064485{col 26}{space 2} .0820112{col 37}{space 1}   -2.52{col 46}{space 3}0.012{col 54}{space 4}-.3671874{col 67}{space 3}-.0457096
{txt}{space 5}regadm9 {c |}{col 14}{res}{space 2} -.140021{col 26}{space 2} .1354077{col 37}{space 1}   -1.03{col 46}{space 3}0.301{col 54}{space 4}-.4054152{col 67}{space 3} .1253732
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.525867{col 26}{space 2} 1.988617{col 37}{space 1}    0.77{col 46}{space 3}0.443{col 54}{space 4}-2.371751{col 67}{space 3} 5.423485
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{help swilk:Shapiro-Wilk test for normality}:
{col 2}Residuals e (standardized){col 30}V = {res}  66.789{txt}{col 44}p-value = {res}0.000
{txt}{col 2}Random effects u{col 30}V = {res}  12.236{txt}{col 44}p-value = {res}0.000
{txt}{hline 78}

{com}. 
. predict eblupROR, eblup //obtain the EBLUPs
{txt}Some of the selected observations are not in the estimation sample. To these, out-of-sample formulas are applied.
{res}{txt}
{com}. predict mseROR, mse //level of precision (MSE)
{txt}Some of the selected observations are not in the estimation sample. To these, out-of-sample formulas are applied.
{res}{txt}
{com}. predict cvROR_FH, cvfh //CV for FH estimate
{txt}Some of the selected observations are not in the estimation sample. To these, out-of-sample formulas are applied.
{res}{txt}
{com}. predict cvROR_direct, cvdirect //CV for direct estimate
{err}log_pobre_extremo (y_log) and directlogvariance (Var(y_log)) provided on logarithmic scale. Both were back-transformed before calculating the coefficient of variation as follows: y = exp(y_log), and Var(y) = Var(y_log)*y^2
{txt}
{com}. 
. label var eblupROR "EBLUP estimator"
{txt}
{com}. label var mseROR "MSE EBLUP"
{txt}
{com}. label var cvROR_FH "CV (FH Model)"
{txt}
{com}. label var cvROR_direct "CV (Direct estimator)"
{txt}
{com}. label var pobre_extremo_munid "Direct estimator"
{txt}
{com}. 
. save "$dataout/fh_pobreextremo_log.dta", replace
{txt}file F:\WB\Poverty Map\Fay_Herriot_estimation\dataout/fh_pobreextremo_log.dta saved

{com}. 
. asdoc sum pobre_extremo_munid cvROR_direct eblupROR cvROR_FH mseROR, save($tables\EBLUP_ExtremePovertyRate.doc) ///
> title(FH Log-Transformed Model - Extreme Poverty Rate (2019/20)) fhc(\b) fs(11) dec(1) label append

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
pobr~o_munid {c |}{res}        210    .7797755    .1846755          0          1
{txt}cvROR_direct {c |}{res}        209    6.845748    9.490986   1.95e-16   70.25448
{txt}{space 4}eblupROR {c |}{res}        316    .7925659    .1620012   .2414605   1.262755
{txt}{space 4}cvROR_FH {c |}{res}        316    15.14319    14.84301   1.95e-16   62.44699
{txt}{space 6}mseROR {c |}{res}        316    .0155554    .0287068   3.01e-36   .3960795

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
pobr~o_munid {c |}{res}        210    .7797755    .1846755          0          1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
cvROR_direct {c |}{res}        209    6.845748    9.490986   1.95e-16   70.25448

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}eblupROR {c |}{res}        316    .7925659    .1620012   .2414605   1.262755

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}cvROR_FH {c |}{res}        316    15.14319    14.84301   1.95e-16   62.44699

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}mseROR {c |}{res}        316    .0155554    .0287068   3.01e-36   .3960795
Click to Open File:  {browse "F:\WB\Poverty Map\Fay_Herriot_estimation\Results\Tables\EBLUP_ExtremePovertyRate.doc"}
{txt}
{com}. 
. restore
{txt}
{com}. 
. 
. 
. 
. 
. ********************************************************************************
. *B) Income of extreme poor
. ********************************************************************************
. 
. 
. 
. *a) Income
. preserve
{txt}
{com}. 
. sum ipcf_var_munid, d

                   {txt}(first) ipcf_var_munid
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res} 6.62e-24              0       {txt}Obs         {res}        210
{txt}25%    {res} 6.86e+08              0       {txt}Sum of Wgt. {res}        210

{txt}50%    {res} 2.41e+10                      {txt}Mean          {res} 1.01e+11
                        {txt}Largest       Std. Dev.     {res} 2.18e+11
{txt}75%    {res} 8.80e+10       1.09e+12
{txt}90%    {res} 2.63e+11       1.18e+12       {txt}Variance      {res} 4.76e+22
{txt}95%    {res} 5.71e+11       1.24e+12       {txt}Skewness      {res} 3.557768
{txt}99%    {res} 1.18e+12       1.35e+12       {txt}Kurtosis      {res} 16.59108
{txt}
{com}. fayherriot ipcf_munid ${c -(}vivvars{c )-} ${c -(}headvars{c )-} ${c -(}hhvars{c )-} ${c -(}munvars{c )-}, variance(ipcf_var_munid) gamma nolog initialvalue(`=r(p50)')

{res}{err}{p}
initial values not feasible
{p_end}
{txt}{search r(1400), local:r(1400);}

end of do-file

{search r(1400), local:r(1400);}

{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}F:\WB\Poverty Map\Fay_Herriot_estimation\Results\Tables\extreme_poverty_log.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}14 Feb 2021, 09:02:00
{txt}{.-}
{smcl}
{txt}{sf}{ul off}